MVI B, 0F ;ΜΕTΡΗΤΗΣ ΕΠΑΝΑΛΗΨΕΩΝ  0-15 ΘΕΣΕΙΣ
LXI H, 3000 ;ΦΟΡΤΩΝΩ  ΤΟ ΠΡΩΤΟ ΔΕΔΟΜΕΝΟ 
MVI E, 00;ΑΡΧΙΚΟΠΟΙΩ ΤΟ ΑΛΑΡΜ 1
MVI D,00;ΑΡΧΙΚΟΠΟΙΩ ΤΟ ΑΛΑΡΜ 2
MOV A, M;METAΦΕΡΩ ΤΟ ΠΡΩΤΟ ΔΕΔΟΜΕΝΟ ΑΠΟ ΤΗΝ ΜΝΗΜΗ ΣΤΟΝ ACCUMULATOR

RETURN:
MOV A, M ;ΦΟΡΤΩΝΩ ΤΟ ΠΡΩΤΟ ΔΕΔΟΜΕΝΟ ΣΤΗΝ ΜΝΗΜΗ
MVI C, 72;BAΖΩ ΜΑΣΚΑ ΤΟΝ ΑΡΙΘΜΟ 72ΗΕΧ ΓΙΑ ΤΗΝ ΑΝΙΧΝΕΥΣΗ
ANA C ;ΓΙΝΕΤΑΙ Η ΑΝΙΧΝΕΥΣΗ ΜΕ ΤΗΝ ΧΡΗΣΗ ΤΟΥ ΛΟΓΙΚΟΥ AND
CMP C ;ΣΥΓΚΡΙΝΩ ΑΝ (Α)=(Β)
JNZ DIFFERENT ;AN EINAI ΔΙΑΦΟΡΕΤΙΚΟΙ ΚΑΝΩ ΑΛΜΑ ΣΤΟ LABEL DIFFERENT
JZ SAME   ;ΑΝ ΕΙΝΑΙ ΙΣΟΙ ΤΟΤΕ ΠΑΩ ΣΤΟ LABEL SAME

FLAG1:
INR L;AΥΞΑΝΩ ΤΟΝ L ΝΑ ΔΕΙΧΝΕΙ ΣΤΗ ΘΕΣΗ ΜΝΗΜΗΣ 3310
MOV M, D;ΕΙΣΑΓΩΓΗ ΠΛΗΘΟΥΣ ΤΩΝ ΑΛΑΡΜ 1
INR L; AΥΞΑΝΩ ΤΟΝ L ΝΑ ΔΕΙΧΝΕΙ ΣΤΗ ΘΕΣΗ 3311
MOV M,Ε ;EΙΣΑΓΩ ΤΟ ΠΛΗΘΟΣ ΤΩΝ ΑΛΑΡΜ 2
HLT

DIFFERENT:
DCR B;MEIΩΝΩ ΤΟΝ ΜΕΤΡΗΤΗ 
INX H;AΥΞΑΝΩ ΤΟΝ HL ΝΑ ΔΕΙΧΝΕΙ ΣΤΟ ΕΠΟΜΕΝΟ ΣΤΟΙΧΕΙΟ
MOV A, M;ΦΕΡΝΩ ΑΠΟ ΜΝΗΜΗ ΤΟ ΕΠΟΜΕΝΟ ΣΤΟΙΧΕΙΟ
JZ RETURN;OTAN MHΔΕΝΙΣΕΙ Ο ΜΕΤΡΗΤΗΣ ΠΑΙΡΝΩ ΤΑ ΔΕΔΟΜΕΝΑ ΣΤΗΝ ΕΞΟΔΟ
JNZ FLAG1

SAME:
MOV A, M;BAΖΩ ΠΑΛΙ ΔΕΔΟΜΕΝΟ ΑΠΟ ΜΝΗΜΗ
INR D; AYΞΑΝΩ ΤΟ ΠΕΡΙΕΧΟΜΕΝΟ ΤΟΥ ΜΕΤΡΗΤΗ ΓΙΑ ΤΟ ΑΛΑΡΜ 1
INR H ;ΔΕΙΧΝΕΙ ΣΤΟ ΕΠΟΜΕΝΟ ΣΤΟΙΧΕΙΟ
MVI C, 7E;EΛΕΝΓΧΩ ΤΟΝ ΕΠΟΜΕΝΟ ΑΡΙΘΜΟ
ANA C ;ΛΟΓΙΚΟ AND ΜΕΤΑΞΥ C KAI A
CMP C ;ΤΣΕΚ ΑΝ ΕΙΝΑΙ ΙΣΟΙ Α ΚΑΙ C
JZ ALARM2
FLAG2
DCR B;MΕΙΩΝΩ ΜΕΤΡΗΤΗ
JNZ RETURN;ΕΠΑΝΑΛΑΜΒΑΝΩ
JZ FLAG1;TEΡΜΑΤΙΖΕΙ ΤΟ ΠΡΟΓΡΑΜΜΑ ΣΤΟ FLAG1

ALARM2:
INR E ; ΑΥΞΑΝΩ  ΤΟ Ε ΔΗΛ TON ΜΕΤΗΤΗ ΓΙΑ ΤΟ ΑΛΑΡΜ2
JMP FLAG2 ;KANΩ ΑΛΜΑ ΣΤΟ FLAG2

