Γ.

MVI B, FFH   ; 7 Τ
external: MVI C, F8H  ; 7 Τ
internal: DCR C   ; 4 Τ
JNZ internal  ; 10 Τ /7Τ
DCR B   ; 4 Τ
JNZ external  ; 10 Τ /7Τ
RET   ; 10 Τ

Τmax= 7+(255*7)+(255*255*4)+(254*255*10)+(255*7)+(255*4)+(254*10)+7+10=914.954Τ

Άρα tmax=  



To πρόγραμμα θα εκτελεστεί σε χρόνο το πολύ 0,4574μsec.



Δ.

Μια καθυστέρηση των 5,5 sec αντιστοιχεί σε 5500ms.Aυτό μπορεί να επιτευχθεί με μία subroutine η οποία θα εισάγει μια συνολική καθυστέρηση των 5500msec.Aπό το ερώτημα Α διαπιστώθηκε ότι όπως είναι σχεδιασμένη συνάρτηση μπορούμε να έχουμε μια καθυστέρηση  της τάξης  των 0,16 sec.Για να ικανοποιήσω την καινούργια απαίτηση αρκεί να εισάγω ένα loop  A όπου προσθέτει 5,5/0,16=34-35 φορές παραπάνω καθυστέρηση.Δηλαδη 22H φορές.

Άρα ο κώδικας θα μπορούσε να τροποποιηθεί ως εξής:

MVI D,22H
A:
MVI B, 60H   
external: MVI C, F8H 
internal: DCR C   
JNZ internal  
DCR B   
JNZ external  
DCR D
JNZ  A
RET   

