LXI D,9100H ;ΑΠΟ ΑΥΤΗ ΤΗ ΔΙΕΥΘΥΝΣΗ ΚΑΙ ΜΕΤΑ ΘΑ ΑΠΟΘΗΚΕΥΣΕΙ ΤΟ ΠΡΟΓΡΑΜΜΑ ΜΟΥ
LXI H,9002H ;ΚΑΤΑΧΩΡΩ ΣΤΟΝ HL ΤΗ ΔΙΕΥΘΥΝΣΗ ΤΟΥ ΠΡΩΤΟΥ ΔΕΔΟΜΕΝΟΥ
MVI B,1AH   ;ΧΡΗΣΙΜΟΠΟΙΕΙΤΑΙ ΩΣ ΜΕΤΡΗΤΗΣ.ΣΥΝΟΛΙΚΑ 26 ΣΤΟΙΧΕΙΑ
MOV Α,Μ     ;KATAXΩΡΩ ΣΤΟΝ ΣΥΣΣΩΡΕΥΤΗ Α  TA ΠΕΡΙΕΧΟΜΕΝΑ ΤΗΣ       ΑDRESS  HL
AGAIN:
ANI 01       ;KANΩ ΤΟ ΛΟΓΙΚΟ AND ΜΕ ΤΟΝ ΚΑΤΑΧΩΡΗΤΗ ΟΠΟΥ ΠΕΡΙΕΧΕΙ                ΤΟ ΠΡΩΤΟ BYTE.
             ;AN EINAI ARTΙΟΣ ΤΟ ΑΠΟΤΕΛΕΣΜΑ ΘΑ ΤΕΛΕΙΩΝEI ΣΕ 0 ΑΛΛΙΩΣ ΣΕ 1.
JZ PERITTOS  ;ΑΝ ΤΟ ΑΠΟΤΕΛΣΜΑ ΔΕΝ ΕΙΝΑΙ 1 ΤΟΤΕ ΕΧΩ ΑΡΤΙΟ ΚΑΙ Ο ΕΛΕΝΓΧΟΣ ΜΕΤΑΦΕΡΕΤΑΙ ΣΤΟ PERITTOS 
JNZ ARTIOS   ;AN ΤΟ ΑΠΟΤΕΛΣΜΑ ΔΕΝ ΕΙΝΑΙ 0 TΟΤΕ ΕΧΩ ΠΕΡΙΤΤΟ.ΑΡΑ ΜΕΤΑΦΕΡΕΤΑΙ Ο ΕΛΕΝΓΧΟΣ ΣΤΟΝ ΕΛΕΝΓΧΟ ARTIOS
TELOS:
HLT          ;ΤΕΡΜΑΤΙΣΜΟΣ

PERITTOS:

MOV A,M      ;ΜΕΤΑΦΕΡΩ ΞΑΝΑ ΤΟ ΠΕΡΙΕΧΟΜΕΝΟ ΤΗΣ ΜΝΗΜΗΣ ΣΤΟΝ ΣΥΣΣΩΡΕΥΤΗ
STAX D       ;AΠΟΘΗΚΕΥΕΤΑΙ Ο Α ΕΚΕΙ ΠΟΥ ΔΕΙΧΝΕΙ Ο D
INX D        ;ΨΑΝΧΩ ΣΤΗΝ ΕΠΟΜΕΝΗ ΘΕΣΗ ΜΝΗΜΗΣ
MOV A,M      ;ΞΑΝΑΦΟΡΤΩΝΩ ΣΤΟΝ Α ΝΕΟ ΑΡΙΘΜΟ
DCR B        ;MEIΩΝΩ ΤΟΝ ΜΕΤΡΗΤΗ ΚΑΤΑ 1
JZ TELOS     ;OTAN TEΛΕΙΩΣΟΥΝ ΟΙ ΕΠΑΝΑΛΗΨΕΙΣ ΤΕΡΜΑΤΙΖΕΙ ΤΟ ΠΡΟΓΡΑΜΜΑ
JNZ AGAIN¨   ;AΛΛΙΩΣ Ο ΕΛΕΝΓΧΟΣ ΕΠΙΣΤΡΕΦΕΙ ΣΤΟ ΑGAIN

ARTIOS:

INX H        ;ΑΥΞΑΝΩ ΤΟΝ ΔΕΙΚΤΗ ΩΣΤΕ ΝΑ ΔΕΙΧΝΕΙ ΣΤΗΝ ΕΠΟΜΕΝΗ ΘΕΣΗ
MOV A,M      ;ΦΟΡΤΩΝΩ ΤΗΝ ΜΝΗΜΗ ΣΤΟΝ ΣΥΣΣΩΡΕΥΤΗ
DCR B        ;MEIΩΝΩ ΤΟΝ Β ΜΕΧΡΙΣ ΩΤΟΥ ΜΗΔΕΝΙΣΕΙ 
JNZ AGAIN    ;ΣΥΝΕΧΙΖΟΝΤΑΙ ΟΙ ΕΠΑΝΑΛΗΨΕΙΣ
JZ TELOS     ;AΛΛΙΩΣ ΤΟ ΠΡΟΓΡΑΜΜΑ ΤΕΡΜΑΤΙΖΕΙ.
